Run python -m pip install pymysql from your terminal to install pymysql.

Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)
cd into your exercises folder for this module and run echo env.py >> .gitignore
Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

Use your function to obtain a connection to the employees database.

Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?
access denied

b. Intentionally make an error in your SQL query. What does the error message look like?
shows a SQL syntax error
Read the employees and titles tables into two separate DataFrames.

How many rows and columns do you have in each DataFrame? Is that what you expected?
6 columns, 5 rows
Display the summary statistics for each DataFrame.

How many unique titles are in the titles DataFrame?

What is the oldest date in the to_date column?

What is the most recent date in the to_date column?

In [2]:
def get_db_url(username, password, hostname, database_name):
    url = f'mysql+pymysql://{env.username}:{env.password}@{env.hostname}/{env.database_name}'

In [3]:
import env

NameError: name 'env' is not defined

In [71]:
from env import host

url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/chipotle'

In [65]:
import pandas as pd

In [66]:
import numpy as np

In [15]:
#url

In [14]:
# from sqlalchemy import text, create_engine

# engine = create_engine(url)

query = 'SELECT * FROM employees'

sql1 = pd.read_sql(query, url)

In [57]:
sql3 = pd.read_sql("""SELECT *
FROM titles
	JOIN employees
		USING(emp_no)""", url)

In [38]:
sql1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

How many unique titles are in the titles DataFrame

In [55]:
sql2

                title
0     Senior Engineer
1               Staff
2            Engineer
3        Senior Staff
4  Assistant Engineer
5    Technique Leader
6             Manager

In [63]:
oldest_to_date = sql2['to_date'].min()
oldest_to_date

datetime.date(1985, 3, 1)

In [69]:
newest_to_date = sql2['to_date'].max()
newest_to_date

datetime.date(9999, 1, 1)

In [71]:
sql1

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [12]:
def getdburl(user,password,host,database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [13]:
url = getdburl(env.user,env.password,env.host,'employees')

In [26]:
pd.read_sql('select * from employees', url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [15]:
np.random.seed(123)

Exercises II
Load the mpg dataset from PyDataset.

Output and read the documentation for the mpg dataset.

How many rows and columns are in the dataset?

Check out your column names and perform any cleanup you may want on them.

Display the summary statistics for the dataset.

How many different manufacturers are there?

How many different models are there?

Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

Do automatic or manual cars have better miles per gallon?

In [17]:
# Copy the users and roles DataFrames from the examples above.
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [18]:
#Copy the users and roles DataFrames from the examples above.
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [21]:
# What is the result of using a right join on the DataFrames?
# Perform an outer join specifying the left and right DataFrame keys.

users.merge(roles, left_on='role_id', right_on='id', indicator=True)

   id_x name_x  role_id  id_y    name_y _merge
0     1    bob      1.0     1     admin   both
1     2    joe      2.0     2    author   both
2     3  sally      3.0     3  reviewer   both
3     4   adam      3.0     3  reviewer   both

In [25]:
# What is the result of using an outer join on the DataFrames?
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [27]:
# What happens if you drop the foreign keys from the DataFrames and try to merge them?
users2 = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
})

users2.merge(roles, left_on='id', right_on='id', how='outer', indicator=True)

   id name_x     name_y     _merge
0   1    bob      admin       both
1   2    joe     author       both
2   3  sally   reviewer       both
3   4   adam  commenter       both
4   5   jane        NaN  left_only
5   6   mike        NaN  left_only

In [ ]:

# Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

# Do automatic or manual cars have better miles per gallon?

In [28]:
from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [29]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [39]:
# How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [35]:
# Check out your column names and perform any cleanup you may want on them.
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [37]:
# Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [47]:
# How many different manufacturers are there?
diff_man = mpg['manufacturer'].nunique()
diff_man

15

In [49]:
unique_manufacturer_counts = mpg['manufacturer'].value_counts().reset_index()
unique_manufacturer_counts.columns = ['Manufacturer', 'Count']
unique_manufacturer_counts

   Manufacturer  Count
0         dodge     37
1        toyota     34
2    volkswagen     27
3          ford     25
4     chevrolet     19
5          audi     18
6       hyundai     14
7        subaru     14
8        nissan     13
9         honda      9
10         jeep      8
11      pontiac      5
12   land rover      4
13      mercury      4
14      lincoln      3

In [50]:
# How many different models are there?
uniq_models = mpg['model'].value_counts().reset_index()
uniq_models.columns = ['Manufacturer', 'Count']
uniq_models

              Manufacturer  Count
0              caravan 2wd     11
1      ram 1500 pickup 4wd     10
2                    civic      9
3                    jetta      9
4        dakota pickup 4wd      9
5                  mustang      9
6              impreza awd      8
7               a4 quattro      8
8       grand cherokee 4wd      8
9                       a4      7
10       toyota tacoma 4wd      7
11            camry solara      7
12                   camry      7
13                 tiburon      7
14                  sonata      7
15                  passat      7
16         f150 pickup 4wd      7
17             durango 4wd      7
18            explorer 4wd      6
19              new beetle      6
20                  altima      6
21             4runner 4wd      6
22            forester awd      6
23                     gti      5
24      c1500 suburban 2wd      5
25                 corolla      5
26                corvette      5
27                  malibu      5
28              grand prix      5
29         k1500 tahoe 4wd      4
30          pathfinder 4wd      4
31         mountaineer 4wd      4
32             range rover      4
33                  maxima      3
34           navigator 2wd      3
35              a6 quattro      3
36          expedition 2wd      3
37  land cruiser wagon 4wd      2

In [51]:
diff_mod = mpg['model'].nunique()
diff_mod

38

In [59]:
# Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

# Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

# Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.
# mpg['mileage_difference'] = mpg.hwy - mpg.cty
# mpg['average_mileage'] = (mpg.hwy + mpg.cty)/2
# mpg['is_automatic'] = mpg['trans'].str.startswith('auto')

In [60]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

In [116]:
# Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
# mpg.average_mileage.max()
# best_mpg_manufacturer = mpg.groupby('manufacturer')['average_mileage'].mean()
# best_mpg_manufacturer = best_mpg_manufacturer.idxmax()
# best_mpg_manufacturer
# mpg[['manufacturer', 'average_mileage']].groupby('manufacturer').max()
mpg[['manufacturer', 'average_mileage']].groupby('manufacturer').mean().round(1).sort_values('average_mileage', ascending=False).head(1)

              average_mileage
manufacturer
honda                    28.5

In [117]:
# Do automatic or manual cars have better miles per gallon?
automatic_mpg = mpg[mpg['is_automatic'] == True]['average_mileage'].mean()
manual_mpg = mpg[mpg['is_automatic'] == False]['average_mileage'].mean()
if automatic_mpg > manual_mpg:
    result =  "Automatic cars have a better miles per gallon average than manuals."
else:
    result = "Manual cars have a better miles per gallon average than automatics."
print(result)
mpg.groupby('is_automatic').mean().average_mileage

Manual cars have a better miles per gallon average than automatics.

TypeError: Could not convert audiaudiaudiaudiaudiaudiaudichevroletchevroletchevroletdodgedodgedodgedodgedodgedodgedodgefordfordfordfordfordfordfordfordhondahondahondahondahondahyundaihyundaihyundaihyundaihyundaihyundaihyundainissannissannissannissannissansubarusubarusubarusubarusubarusubarusubarutoyotatoyotatoyotatoyotatoyotatoyotatoyotatoyotatoyotatoyotatoyotatoyotatoyotatoyotavolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagenvolkswagen to numeric

Exercises III
Join the employees and titles DataFrames together.

For each title, find the hire date of the employee that was hired most recently with that title.

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [79]:
# Use your get_db_url function to help you explore the data from the chipotle database.

# What is the total price for each order?
query = """
SELECT order_id, SUM(CAST(SUBSTRING(item_price, 2) AS DECIMAL(5, 2))) AS total_price
FROM orders
GROUP BY order_id;
"""

sql3 = pd.read_sql(query, url)
sql3

      order_id  total_price
0            1        11.56
1            2        16.98
2            3        12.67
3            4        21.00
4            5        13.70
...        ...          ...
1829      1830        23.00
1830      1831        12.90
1831      1832        13.20
1832      1833        23.50
1833      1834        28.75

[1834 rows x 2 columns]

In [85]:
query = '''SELECT item_name, SUM(quantity) AS total_ordered
FROM orders
GROUP BY item_name
ORDER BY total_ordered DESC
LIMIT 3'''
most_ordered = pd.read_sql(query, url)
most_ordered

             item_name  total_ordered
0         Chicken Bowl          761.0
1      Chicken Burrito          591.0
2  Chips and Guacamole          506.0

In [132]:
query = 'Select * From orders'
orders = pd.read_sql(query, url)
orders

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.orders' doesn't exist")
[SQL: Select * From orders]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [87]:
# Which item has produced the most revenue?

query = '''SELECT item_name, SUM(quantity * CAST(SUBSTRING(item_price, 2) AS DECIMAL(10, 2))) AS total_revenue
FROM orders
GROUP BY item_name
ORDER BY total_revenue DESC
LIMIT 1'''
total_revenue = pd.read_sql(query, url)
total_revenue

      item_name  total_revenue
0  Chicken Bowl        8044.63

In [93]:
query = '''select *
from employees
	JOIN titles
		USING(emp_no)
        '''
etit = pd.read_sql(query, url)
etit

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

In [ ]:
# For each title, find the hire date of the employee that was hired most recently with that title.

In [95]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [96]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [99]:
pd.merge(users, roles, how="right", left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [101]:
pd.merge(users, roles, how="outer", left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [103]:
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [107]:
users = users.drop(columns='role_id')

In [112]:
pd.merge(users, roles, how="outer", right_on='id')

MergeError: Must pass "left_on" OR "left_index".

In [119]:
pd.merge(users, roles, how="right", right_on='id')

MergeError: Must pass "left_on" OR "left_index".

In [124]:
orders.item_price.str.replace('$','')
# astype(float)

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [128]:
orders = orders.item_price.str.strip('$').astype(float)
orders.groupby('order_id').sum().item_price

AttributeError: 'Series' object has no attribute 'item_price'

In [130]:
orders.groupby(['item_name','quantity'])

KeyError: 'item_name'

In [133]:
orders.groupby(['item_name']).sum().quantity.nlargest(3)

KeyError: 'item_name'

In [ ]:
orders.groupby('item_name').item_price.sum().nlargest(1)

In [134]:
employees.head()

NameError: name 'employees' is not defined

In [136]:
df_emps = pd.merge(employees, titles, how='inner', on='emp_no')

NameError: name 'employees' is not defined

In [ ]:
df_emps.groupby('title').hire_date.max()

In [ ]:
df_emps.crosstab

In [137]:
get_db_url(env.user, env.password, env.host, 'employees')

AttributeError: module 'env' has no attribute 'username'

In [139]:
pd.read_sql('show tables', url)

  Tables_in_employees
0         departments
1            dept_emp
2        dept_manager
3           employees
4            salaries
5              titles

In [140]:
query = '''
select *
from dept_emp
    join departments
        using (dept_no)
'''

In [144]:
df_depts = pd.read_sql(query, url)

In [147]:
df_depts.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [150]:
df_all = pd.merge(df_depts, df_emps, how='inner', on='emp_no')

NameError: name 'df_emps' is not defined

In [ ]:
pd.crosstab(df_all.title, df_all.dept_name)